---
title: Streaming multimedia
menu: streaming/index
layout: article
hero_image: /img/common/hero/streaming-index.jpg
hero_heading: Multimedia sin fronteras
---
<h2>&iquest;Qu&eacute; es <em>streaming</em>?</h2>
<p>Se denomina <strong>streaming</strong> a la tecnolog&iacute;a que permite la transmisi&oacute;n de contenidos multimedia (tanto audio como audio+video) a trav&eacute;s de una red (ya sea internet o una LAN) de manera tal que el cliente pueda acceder a esta informaci&oacute;n <em>a medida que se est&aacute; descargando</em>, en contraposici&oacute;n con el m&eacute;todo tradicional que requiere que se descargue completamente un archivo para luego poder abrirlo con alg&uacute;n programa en particular.</p>

<h2>&iquest;Qu&eacute; utilidad le puedo dar a esta tecnolog&iacute;a?</h2>
<p>Existe una gran cantidad y variedad de usos para el streaming, aunque los escenarios m&aacute;s t&iacute;picos incluyen:</p>

<ul>
 <li>Emitir en vivo la transmisi&oacute;n de una radio o emisora de televisi&oacute;n a trav&eacute;s de internet.</li>
 <li>Colocar contenido multimedia (spots publicitarios, videoclips, presentaciones, etc.) dentro de un sitio web.</li>
 <li>Monitorear v&iacute;a remota, a trav&eacute;s de internet, c&aacute;maras de vigilancia conectadas a un CCTV.</li>
</ul>

<h2>&iquest;No es lo mismo simplemente colocar un archivo de video o de audio en mi sitio web?</h2>
<p>
<img src="{{ "/img/common/streaming/cd01.jpg" | prepend: site.baseurl }}" width="230px" height="113px" class="float-left">
A primera vista se puede pensar que s&iacute;, despu&eacute;s de todo cuando un usuario hace click sobre el enlace lo m&aacute;s probable es que se abra un reproductor que permita ver (o escuchar) el archivo.</p>
<p>Sin embargo el streaming permite visualizar un un archivo <em>a medida que se descarga</em>, esto es, tan pronto el usuario recibe una parte del contenido ya es capaz de acceder a &eacute;l. Esto significa que si se quiere poner a disposici&oacute;n de los usuarios una pel&iacute;cula de varios minutos (o incluso <em>horas</em>) de duraci&oacute;n, no es necesario esperar a que se baje completamente el archivo (que puede llegar a ser muy grande, incluso para los usuarios de banda ancha), el contenido est&aacute; disponible inmediatamente.</p>
<p>M&aacute;s importante a&uacute;n, el streaming es el &uacute;nico m&eacute;todo que permite entregar contenido <em>en vivo</em>, es decir contenido que se est&aacute; generando al mismo tiempo que se est&aacute; transmitiendo, como es el caso de la transmisi&oacute;n de una radio en vivo a trav&eacute;s de internet.</p>

<h2>&iquest;Existen demoras entre la emisi&oacute;n en vivo y la repetici&oacute;n en internet?</h2>
<p>S&iacute;, hay demoras ocasionadas por diversos factores tales como la congesti&oacute;n en las redes que deba atravesar el <strong>stream de datos</strong> y la configuraci&oacute;n de los <strong>clientes</strong> (las computadoras que act&uacute;an como <em>receptores</em>). No obstante, estas demoras suelen estar dentro del margen de unos pocos segundos.</p>
{% include article.sidebar.begin.html %}
<h2>Enlaces relacionados</h2>
<ul>
  <li><a href="{{ "/es/streaming/audio.html" | prepend: site.baseurl }}">Streaming de audio</a></li>
  <li><a href="{{ "/es/streaming/video.html" | prepend: site.baseurl }}">Streaming de video</a></li>
</ul>
