---
title: Configuraci&oacute;n de Outlook 2007
layout: article
---

<ol>
<li>Inicie Outlook, y en el men&uacute; <strong>Herramientas</strong>, haga clic en <strong>Configuraci&oacute;n de la cuenta</strong>.
<p><img src="{{ "/img/es/tutoriales/configuracion-de-outlook-2007/001.jpg" | prepend: site.baseurl }}" width="578px" height="447px" alt="" class="img-fluid"></p>
</li>

<li>En la ventana siguiente haga clic en el bot&oacute;n <strong>Nuevo...</strong>
<p><img src="{{ "/img/es/tutoriales/configuracion-de-outlook-2007/002.jpg" | prepend: site.baseurl }}" width="630px" height="312px" alt="" class="img-fluid"></p>
</li>

<li>En la ventana siguiente seleccione la opci&oacute;n <strong>Microsoft Exchange, POP3, IMAP o HTTP</strong>.
<p><img src="{{ "/img/es/tutoriales/configuracion-de-outlook-2007/003.jpg" | prepend: site.baseurl }}" width="705px" height="604px" alt="" class="img-fluid"></p>
</li>

<li>En la ventana siguiente marcar la opci&oacute;n <strong>Configurar manualmente las opciones del servidor...</strong>
<p><img src="{{ "/img/es/tutoriales/configuracion-de-outlook-2007/004.jpg" | prepend: site.baseurl }}" width="705px" height="606px" alt="" class="img-fluid"></p>
</li>

<li>Seleccione la primer opci&oacute;n y haga clic en <strong>Siguiente</strong>.
<p><img src="{{ "/img/es/tutoriales/configuracion-de-outlook-2007/005.jpg" | prepend: site.baseurl }}" width="705px" height="604px" alt="" class="img-fluid"></p>
</li>

<li>Complete los siguiente datos:
<ul>
<li>Su nombre: <em>el nombre que aparecer&aacute; en los correos que env&iacute;e (por ejemplo, Juan Perez)</em></li>
<li>Direcci&oacute;n de correo electr&oacute;nico: <em>la direcci&oacute;n que est&aacute; configurando (por ejemplo, nombre@dominio.com)</em></li>
<li>Tipo de cuenta: <strong>POP3</strong></li>
<li>Servidor de correo entrante: <em>el servidor de correo entrante que le fue asignado (por ejemplo, mail.dominio.com)</em></li>
<li>Servidor de correo saliente (SMTP): <em>el servidor de correo saliente que le fue asignado (por ejemplo, mail.dominio.com)</em></li>
<li>Nombre de usuario: <em>la misma direcci&oacute;n de correo (por ejemplo, nombre@dominio.com)</em></li>
<li>Contrase&ntilde;a: <em>su contrase&ntilde;a</em></li>
</ul>
Luego marcar <strong>Recordar contrase&ntilde;a</strong> y hacer clic en <strong>M&aacute;s configuraciones...</strong>
<p><img src="{{ "/img/es/tutoriales/configuracion-de-outlook-2007/006.jpg" | prepend: site.baseurl }}" width="705px" height="605px" alt="" class="img-fluid"></p>
</li>

<li>En la siguiente ventana, hacer clic sobre la pesta&ntilde;a <strong>Servidor de salida</strong> y luego marcar <strong>Mi servidor de salida (SMTP) requiere autenticaci&oacute;n</strong>.
Dejar seleccionada la opci&oacute;n <strong>Utilizar la misma configuraci&oacute;n que mi servidor de correo de entrada</strong>.
<p><img src="{{ "/img/es/tutoriales/configuracion-de-outlook-2007/007.jpg" | prepend: site.baseurl }}" width="705px" height="684px" alt="" class="img-fluid"></p>
</li>

<li>Hacer clic en <strong>Aceptar</strong> y luego en <strong>Siguiente</strong> y <strong>Finalizar</strong> hasta completar la configuraci&oacute;n.</li>


<li>Ahora el Outlook est&aacute; configurado tanto para enviar como para revisar el correo de su cuenta.</li>

</ol>
