---
title: Configuraci&oacute;n de su cuenta SIP en softphone X-Ten o X-Pro
---
<h1>{{ page.title }}</h1>
<ol>
<li>Cargar el programa (ya sea X-Ten, X-Lite o X-Pro) en su computadora.</li>

<li>Si es la primera vez que lo utiliza, aparecer&aacute; autom&aacute;ticamente la ventana donde se le solicitar&aacute;n los datos de su cuenta SIP.
Si ya ten&iacute;a una cuenta cargada, deber&aacute; seguir los siguientes pasos:
  <ol>
    <li>Hacer clic en el bot&oacute;n indicado en la imagen (a la derecha del bot&oacute;n <strong>CLEAR</strong>, en el centro del programa).
    <p><img src="{{ "/images/es/tutoriales/configuracion-de-xpro/010.jpg" | prepend: site.baseurl }}" width="240px" height="110px"></p>
    </li>
    <li>Seleccionar System Settings -&gt; SIP Proxy -&gt; [Default]</li>
  </ol>
</li>

<li><img src="{{ "/images/es/tutoriales/configuracion-de-xpro/002.jpg" | prepend: site.baseurl }}" class="toright">Una vez en la ventana de configuraci&oacute;n de la cuenta SIP por defecto, se deber&aacute;n completar los siguientes datos:
  <ul>
  <li>Enabled: Yes</li>
  <li>Display Name: <em>Su n&uacute;mero VoIP</em></li>
  <li>Username: <em>Su n&uacute;mero VoIP</em></li>
  <li>Password: <em>Su contrase&ntilde;a</em></li>
  <li>Domain/Realm: <em>El servidor que le fue asignado (normalmente sip.netcomsatelital.com.ar)</em></li>
  <li>SIP Proxy: <em>El mismo que en el campo Domain/Realm</em></li>
  </ul>
El resto de los campos dejarlos en sus valores por defecto.
</li>

<li style="clear:both">Luego pulsar el bot&oacute;n <strong>BACK</strong> (abajo a la izquierda de la ventana).</li>

<li><img src="{{ "/images/es/tutoriales/configuracion-de-xpro/008.jpg" | prepend: site.baseurl }}" class="toleft">Ya se puede cerrar la ventana del men&uacute; de configuraci&oacute;n haciendo clic en el bot&oacute;n con la <strong>"X"</strong> arriba a la derecha de la misma.</li>

<li style="clear:both">En la pantalla principal del softphone deber&iacute;a aparecer la leyenda <strong>"Logged in - Enter phone number"</strong> como indicativo de que se pudo registrar correctamente en el servidor.
<p><img src="{{ "/images/es/tutoriales/configuracion-de-xpro/011.jpg" | prepend: site.baseurl }}"></p></li>
</ol>


<h2>Cambio de puertos</h2>

<p><img src="{{ "/images/es/tutoriales/configuracion-de-xpro/009.jpg" | prepend: site.baseurl }}" class="toright">En caso de tener m&aacute;s de un cliente SIP dentro de la misma LAN, es conveniente hacer que los mismos utilicen puertos de se&ntilde;alizaci&oacute;n y RTP distintos.
Para ello se deben seguir los siguientes pasos:</p>

<ol>
<li>Dentro del programa, ingresar al men&uacute; de opciones.</li>
<li>Seleccionar System Settings -&gt; Network</li>
<li>Cambiar los valores de los campos <strong>"Listen SIP Port"</strong> y <strong>"Listen RTP Port"</strong>. Se pueden poner, por ejemplo, 5061 y 8001 respectivamente, pero no deben repetirse en otros clientes SIP.</li>
<li>Pulsar el bot&oacute;n <strong>BACK</strong> (abajo a la izquierda de la ventana).</li>
<li>Salir del programa y volver a ingresar para que los cambios tengan efecto.</li>
</ol>


<h2>Codec g729</h2>
<p>Si est&aacute; utilizando X-Pro, es conveniente activar el codec g729 para mejorar la relaci&oacute;n calidad de audio/consumo de ancho de banda.</p>
<p>Para ello basta con hacer clic sobre la leyenda <strong>"G729"</strong> que aparece en la parte inferior del display del tel&eacute;fono.
Si estaba desactivado el texto aparecer&aacute; de color gris. Una vez activado, cambiar&aacute; el color a negro.</p>
<p>Es posible que al activar el codec g729 aparezca una ventana preguntando si est&aacute; seguro que desea hacerlo. Responder que s&iacute;.</p>
