---
title: Configuraci&oacute;n de Outlook Express
---
<h1>{{ page.title }}</h1>
<ol>
<li>Inicie Outlook Express, y en el men&uacute; <strong>Herramientas</strong>, haga clic en <strong>Cuentas</strong>.</li>

<li>Haga clic en Agregar y, a continuaci&oacute;n, en Correo para abrir el Asistente para la conexi&oacute;n a Internet.
<p><img src="{{ "/images/es/tutoriales/configuracion-de-outlook-express/001.jpg" | prepend: site.baseurl }}" width="300px" height="170px"></p>
</li>

<li>En la p&aacute;gina <strong>Su nombre</strong> del asistente, escriba su nombre tal y como desea que lo vean todos los destinatarios de sus mensajes de correo electr&oacute;nico y, despu&eacute;s, haga clic en <strong>Siguiente</strong>.</li>

<li>En la p&aacute;gina <strong>Direcci&oacute;n de correo electr&oacute;nico de Internet</strong>, escriba su direcci&oacute;n de correo electr&oacute;nico y, a continuaci&oacute;n, haga clic en <strong>Siguiente</strong>.</li>

<li>En la p&aacute;gina <strong>Nombre del servidor de correo electr&oacute;nico</strong> rellene los siguientes datos y haga clic en <strong>Siguiente</strong>:</li>
<ul>
<li>Mi servidor de correo entrante es: <strong>IMAP</strong></li>
<li>Servidor de correo entrante: <strong>mail.netcomsatelital.com.ar</strong></li>
<li>Servidor de correo saliente: <strong>mail.netcomsatelital.com.ar</strong></li>

</ul>

<li>En la p&aacute;gina <strong>Inicio de sesi&oacute;n del correo de Internet</strong>, su direcci&oacute;n de correo en la casilla <strong>Nombre de cuenta</strong> y la contrase&ntilde;a correspondiente.
<p><img src="{{ "/images/es/tutoriales/configuracion-de-outlook-express/002.jpg" | prepend: site.baseurl }}" width="326px" height="250px"></p>
</li>

<li>Haga clic en Siguiente y, despu&eacute;s, en <strong>Finalizar</strong>.</li>

<li>A partir de ahora est&aacute; listo para revisar el correo desde ese equipo. Para poder enviar correo hay que realizar un paso extra:</li>

<li>En el men&uacute; <strong>Herramientas</strong>, opci&oacute;n <strong>Cuentas</strong> hacer hacer doble clic sobre la cuenta de correo que se acaba de crear.</li>

<li>En la pesta&ntilde;a <strong>Servidores</strong> marcar la opci&oacute;n <strong>Mi servidor requiere autenticaci&oacute;n</strong>.</li>

<li>En la pesta&ntilde;a <strong>IMAP</strong> escribir la palabra <strong>INBOX</strong> en la casilla <strong>Ruta de la carpeta ra&iacute;z</strong> (la primer casilla de texto).</li>

<li>Hacer clic en <strong>Aceptar</strong>.</li>

<li>Ahora el Outlook Express est&aacute; configurado tanto para enviar como para revisar el correo de su cuenta.</li>

</ol>
